app/controllers/home_controller.rb

INSERT INTO "profusers" ("updated_at", "userid", "filename", "created_at") VALUES('2010-08-10 15:58:16', '1a09e2d5299623a97da3573057c75e26', 'icon.xpm', '2010-08-10 15:58:16')
---
  def uploadFile
    Fileupload.save(params[:upload])
    upload=params[:upload]
    name =  upload['datafile'].original_filename
    puts params[:upload]
    sessid = session[:session_id]
    @profusers = Profuser.new(:filename => name , :userid => sessid)
    @profusers.save