app/controllers/property_controller.rb

SELECT * FROM "properties"
---
  def add
    if session[:auth] != true
      redirect_to :controller=>"home", :action=> "index"
    end
    if session[:auth] == true
      @properties = Property.all

INSERT INTO "properties" ("name", "updated_at", "entity", "property_type", "created_at") VALUES('IPAddress', '2010-07-22 21:02:07', 'Environment', 'Equatable', '2010-07-22 21:02:07')
---
  def insert
    # insert takes input from the textfields filled by the user and insert them into the properties database for later use.
    if session[:auth] != true
      redirect_to :controller=>"home", :action=> "index"
    end
    if session[:auth] == true
    @properties = Property.new(:name => params[:name], :entity => params[:entity], :property_type => params[:property_type])
    @properties.save

SELECT * FROM "administrators" WHERE (username = 'm') LIMIT 1
---
  def validate
    # validate is used to check if the inputed user-name and password are correct i.e. they exist in the database. Note: the password is encrypted for security purposes.
    @hashedpass = Digest::SHA1.hexdigest params[:password]

    administratordata1 = Administrator.first(:conditions => ["name = ?", params[:name]])

INSERT INTO "administrators" ("name", "updated_at", "lname", "fname", "password", "email", "created_at") VALUES('g', '2010-07-30 04:59:47', 'g', 'g', '54fd1711209fb1c0781092374132c66e79e2241b', 'g', '2010-07-30 04:59:47')
---
  def create
    # If an adminstrator doesn't have an account, he can register if and only if he has the correct code for that, thus, this function validates the provided information and addes them to the administrator's database.
    puts params[:password]
    puts params[:password2]
    if  params[:password] ==  params[:password2]
        @hashedpass = Digest::SHA1.hexdigest params[:password]
        @administrators = Administrator.new(:name => params[:name],  :password => @hashedpass,  :fname => params[:fname], :lname => params[:lname], :email => params[:email])
            if @administrators.save

SELECT * FROM "activities"
---
  def addactivity
    # addactivity function is used to load all the activities which are present in the database and display them on the view as a table with all thier attributes listed.
    if session[:auth] != true
      redirect_to :controller=>"home", :action=> "index"
    end
    if session[:auth] == true
      @activities = Activity.all

INSERT INTO "activities" ("name", "updated_at", "created_at") VALUES('Print', '2010-07-26 13:58:44', '2010-07-26 13:58:44')
---
  def insertactivity
    # insertactivity is used to insert a new activity to the database, it takes the input from the views and validates them and insert them into the activity database.
    if session[:auth] != true
      redirect_to :controller => "home", :action=> "index"
    end
    if session[:auth] == true
    @activities = Activity.new(:name => params[:name])
    @activities.save