app/controllers/userpage_controller.rb

  def input
    sessid = session[:session_id]
    @msg=""
    if((File.exist? "public/data_lic/restrictions"+sessid+".xml")==true)
      @msg = myprinter2("public/data_lic/restrictions"+ sessid +".xml")
    end
    @activities = Activity.all
---
SELECT * FROM "activities"

  def typeupdate

      @prop = Property.find_by_name(params[:name])
---
SELECT * FROM "properties" WHERE ("properties"."name" = 'Location') LIMIT 1


    @counter = 1
    #fetch the activity chosen from the database by the action ID obtained
    @act = Activity.find_by_id(selected_activity)
    #get the entity-restriction type depending on the property
    @property = Property.find_by_name(selected_property)
---
SELECT * FROM "activities" WHERE ("activities"."id" = '1') LIMIT 1
SELECT * FROM "properties" WHERE ("properties"."name" = 'Date') LIMIT 1

  def downloadlic
    lc = MyLicenseObjectCreator.new()
    sessid = session[:session_id]
    @profusers = Profuser.find_by_userid(sessid)
---
SELECT * FROM "profusers" WHERE ("profusers"."userid" = '1a09e2d5299623a97da3573057c75e26') LIMIT 1

  def deleteprof
    sessid = session[:session_id]
    @profusers = Profuser.find_by_userid(sessid)
    @profusers.delete()
---
SELECT * FROM "profusers" WHERE ("profusers"."userid" = '1a09e2d5299623a97da3573057c75e26') LIMIT 1
DELETE FROM "profusers" WHERE ("id" IN (1))